<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
#Please uncomment and execute the code below if you are working locally.

#!pip install ipython-sql

In [2]:
#%load_ext sql

In [1]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
!pip install -q pandas==1.1.5

In [ ]:
#%sql sqlite:///my_data1.db

In [5]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  both result in 0.1234 being formatted as 0.12.

**Note:This below code is added to remove blank rows from table**

In [6]:
#%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

# I found too many errors, I don't use the line magics, I use pd.read_sql_query(QUERY, con) and the con. Also could use cur.execute, but I prefer the first

In [9]:
cur.execute("CREATE TABLE SPACEXTABLE AS SELECT * FROM SPACEXTBL WHERE Date IS NOT NULL")
con.commit()

In [2]:
import pandas as pd
QUERY = """SELECT name FROM sqlite_master WHERE type='table';"""
# Ejecutar la consulta y obtener los resultados en un DataFrame
df = pd.read_sql_query(QUERY, con)
print(df)

          name
0    SPACEXTBL
1  SPACEXTABLE

In [3]:
for valor in df['name']:
    QUERY = f'PRAGMA TABLE_INFO({valor});'
    df1 = pd.read_sql_query(QUERY, con)
    print(f'El contenido de la tabla {valor}\n')
    print(df1)
    print()

El contenido de la tabla SPACEXTBL

   cid               name     type  notnull dflt_value  pk
0    0               Date     TEXT        0       None   0
1    1         Time (UTC)     TEXT        0       None   0
2    2    Booster_Version     TEXT        0       None   0
3    3        Launch_Site     TEXT        0       None   0
4    4            Payload     TEXT        0       None   0
5    5  PAYLOAD_MASS__KG_  INTEGER        0       None   0
6    6              Orbit     TEXT        0       None   0
7    7           Customer     TEXT        0       None   0
8    8    Mission_Outcome     TEXT        0       None   0
9    9    Landing_Outcome     TEXT        0       None   0

El contenido de la tabla SPACEXTABLE

   cid               name  type  notnull dflt_value  pk
0    0               Date  TEXT        0       None   0
1    1         Time (UTC)  TEXT        0       None   0
2    2    Booster_Version  TEXT        0       None   0
3    3        Launch_Site  TEXT        0       None   0
4    4            Payload  TEXT        0       None   0
5    5  PAYLOAD_MASS__KG_   INT        0       None   0
6    6              Orbit  TEXT        0       None   0
7    7           Customer  TEXT        0       None   0
8    8    Mission_Outcome  TEXT        0       None   0
9    9    Landing_Outcome  TEXT        0       None   0

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [12]:
QUERY = """
SELECT DISTINCT(Launch_site)
FROM SPACEXTABLE;
"""
df = pd.read_sql_query(QUERY, con)
df.head

<bound method NDFrame.head of     Launch_Site
0   CCAFS LC-40
1   VAFB SLC-4E
2    KSC LC-39A
3  CCAFS SLC-40>


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [11]:
QUERY = """
SELECT *
FROM SPACEXTABLE
WHERE Launch_Site LIKE 'CCA%'
LIMIT 5;
"""
df = pd.read_sql_query(QUERY, con)
df

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-10-08,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-03-01,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [14]:
QUERY = """
SELECT CUSTOMER, SUM (PAYLOAD_MASS__KG_) AS TOTAL_PAYLOAD
FROM SPACEXTABLE
WHERE CUSTOMER = 'NASA (CRS)';
"""
df = pd.read_sql_query(QUERY, con)
df

     Customer  TOTAL_PAYLOAD
0  NASA (CRS)          45596

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [15]:
QUERY = """
SELECT  Booster_Version, AVG(PAYLOAD_MASS__KG_) AS AVG_PAYLOAD
FROM SPACEXTABLE
WHERE Booster_Version = 'F9 v1.1';
"""
df = pd.read_sql_query(QUERY, con)
df

  Booster_Version  AVG_PAYLOAD
0         F9 v1.1       2928.4

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [17]:
QUERY = """
SELECT  Landing_Outcome, MIN(Date) AS FIRST_DATE
FROM SPACEXTABLE
WHERE Landing_Outcome = 'Success (ground pad)';
"""
df = pd.read_sql_query(QUERY, con)
df

        Landing_Outcome  FIRST_DATE
0  Success (ground pad)  2015-12-22

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [20]:
QUERY = """
SELECT Booster_Version, Landing_Outcome, PAYLOAD_MASS__KG_
FROM SPACEXTABLE
WHERE (Landing_Outcome = 'Success (drone ship)') AND (PAYLOAD_MASS__KG_ BETWEEN 4001 AND 5999)
;
"""
df = pd.read_sql_query(QUERY, con)
df

  Booster_Version       Landing_Outcome  PAYLOAD_MASS__KG_
0     F9 FT B1022  Success (drone ship)               4696
1     F9 FT B1026  Success (drone ship)               4600
2  F9 FT  B1021.2  Success (drone ship)               5300
3  F9 FT  B1031.2  Success (drone ship)               5200

### Task 7




##### List the total number of successful and failure mission outcomes

In [22]:
QUERY = """
SELECT OUTCOME, COUNT(*)
FROM
	(SELECT CASE
	WHEN Mission_Outcome LIKE 'Success%' THEN 'Success'
	ELSE 'Failure'
	END AS OUTCOME
	FROM SPACEXTABLE)
GROUP BY OUTCOME
;
"""
df = pd.read_sql_query(QUERY, con)
df

   OUTCOME  COUNT(*)
0  Failure         1
1  Success       100

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [25]:
QUERY = """
SELECT Booster_Version, PAYLOAD_MASS__KG_
FROM SPACEXTABLE
WHERE PAYLOAD_MASS__KG_ =	(SELECT MAX(PAYLOAD_MASS__KG_)
                            FROM SPACEXTABLE);
"""
df = pd.read_sql_query(QUERY, con)
df

   Booster_Version  PAYLOAD_MASS__KG_
0    F9 B5 B1048.4              15600
1    F9 B5 B1049.4              15600
2    F9 B5 B1051.3              15600
3    F9 B5 B1056.4              15600
4    F9 B5 B1048.5              15600
5    F9 B5 B1051.4              15600
6    F9 B5 B1049.5              15600
7   F9 B5 B1060.2               15600
8   F9 B5 B1058.3               15600
9    F9 B5 B1051.6              15600
10   F9 B5 B1060.3              15600
11  F9 B5 B1049.7               15600

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [27]:
QUERY = """
SELECT CASE
	WHEN STRFTIME('%m',DATE) = '01' THEN 'January'
	WHEN STRFTIME('%m',DATE) = '02' THEN 'February'
	WHEN STRFTIME('%m',DATE) = '03' THEN 'March'
	WHEN STRFTIME('%m',DATE) = '04' THEN 'April'
	WHEN STRFTIME('%m',DATE) = '05' THEN 'May'
	WHEN STRFTIME('%m',DATE) = '06' THEN 'June'
	WHEN STRFTIME('%m',DATE) = '07' THEN 'July'
	WHEN STRFTIME('%m',DATE) = '08' THEN 'Augoust'
	WHEN STRFTIME('%m',DATE) = '09' THEN 'September'
	WHEN STRFTIME('%m',DATE) = '10' THEN 'October'
	WHEN STRFTIME('%m',DATE) = '11' THEN 'November'
	ELSE 'December'	
END AS MONTH, STRFTIME('%Y', DATE) as Year,
Landing_Outcome,  Booster_Version, Launch_Site
FROM SPACEXTABLE
WHERE (Landing_Outcome = 'Failure (drone ship)') AND (STRFTIME('%Y', DATE) = '2015');
"""
df = pd.read_sql_query(QUERY, con)
df

     MONTH  Year       Landing_Outcome Booster_Version  Launch_Site
0  January  2015  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1    April  2015  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [28]:
QUERY = """
 SELECT Landing_Outcome, count(*) AS Total_Count
 FROM SPACEXTABLE
 WHERE DATE BETWEEN '2010-06-04' AND '2017-03-20'
 GROUP BY Landing_Outcome
 HAVING Landing_Outcome IN ('Failure (drone ship)', 'Success (ground pad)')
 ORDER BY Total_Count DESC;
"""
df = pd.read_sql_query(QUERY, con)
df

        Landing_Outcome  Total_Count
0  Failure (drone ship)            5
1  Success (ground pad)            3

In [29]:
# cerrar la conexion
con.close()

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>